tests/airfoil/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/freestreamConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $p;

boundaryField
{
    "(inlet_1|outlet_2)"
    {
        type            characteristicFarfieldPressure;
        #include        "include/freestreamConditions"
        value           $internalField;
    }

    symplane_3
    {
        type            empty;
    }

    wall_4
    {
        type            characteristicWallPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
