tests/airfoil/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.4e-4;

boundaryField
{
    wall_4
    {
        type            boundaryCorrectedFixedValue;
        value           uniform 0;
    }

    "(inlet_1|outlet_2)"
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    "(symplane_3)"
    {
        type            empty;
    }
}


// ************************************************************************* //
